In [1]:
import pandas as pd

In [2]:
friend_dict_list = [{'name': 'Jone', 'age': 15, 'job': 'student'}, 
                {'name': 'Jenny', 'age': 30, 'job': 'developer'},
                {'name': 'Nate', 'age': 30, 'job': 'teacher'}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'age', 'job'])
df

    name  age        job
0   Jone   15    student
1  Jenny   30  developer
2   Nate   30    teacher

In [4]:
df['salary']=0 #열 삽입
df

    name  age        job  salary
0   Jone   15    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0

In [6]:
import numpy as np

In [9]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no') #조건문처럼
df.head()

    name  age        job salary
0   Jone   15    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes

In [14]:
friend_dict_list = [{'name': 'Jone', 'mid': 95, 'final': 85}, 
                {'name': 'Jenny', 'mid': 85, 'final': 80},
                {'name': 'Nate', 'mid': 55, 'final': 45}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'mid', 'final'])
df

    name  mid  final
0   Jone   95     85
1  Jenny   85     80
2   Nate   55     45

In [15]:
df['total']= df['mid'] + df['final']
df.head()

    name  mid  final  total
0   Jone   95     85    180
1  Jenny   85     80    165
2   Nate   55     45    100

In [17]:
df['average']= df['total']/2
df

    name  mid  final  total  average
0   Jone   95     85    180     90.0
1  Jenny   85     80    165     82.5
2   Nate   55     45    100     50.0

In [21]:
grades=[]

for row in df['average']:
    if row >= 90:
        grades.append('A')
    elif row >= 80:
        grades.append('B')
    else:
        grades.append('F')

In [22]:
df['grade']= grades
df.head()

    name  mid  final  total  average grade
0   Jone   95     85    180     90.0     A
1  Jenny   85     80    165     82.5     B
2   Nate   55     45    100     50.0     F

# apply 이용

In [23]:
def pass_or_fail(row):
    if row != 'F':
        return "Pass"
    else:
        return "Fail"

In [24]:
df.grade= df.grade.apply(pass_or_fail)

In [25]:
df

    name  mid  final  total  average grade
0   Jone   95     85    180     90.0  Pass
1  Jenny   85     80    165     82.5  Pass
2   Nate   55     45    100     50.0  Fail

In [26]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
         {'yyyy-mm-dd': '2002-09-24'},
         {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [29]:
def extract_year(row):
    return row.split('-')[0] #0번째 인자만 대쉬로 구분할래
df['year']= df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

# 행 만들기

In [30]:
friend_dict_list = [{'name': 'Jone', 'mid': 95, 'final': 85}, 
                {'name': 'Jenny', 'mid': 85, 'final': 80},
                {'name': 'Nate', 'mid': 55, 'final': 45}]
df = pd.DataFrame(friend_dict_list, columns = ['name', 'mid', 'final'])
df

    name  mid  final
0   Jone   95     85
1  Jenny   85     80
2   Nate   55     45

In [33]:
df2= pd.DataFrame([
    ['Ben', 50,50]], columns= ['name', 'mid', 'final'])
df2

  name  mid  final
0  Ben   50     50

In [35]:
df.append(df2, ignore_index= True)

    name  mid  final
0   Jone   95     85
1  Jenny   85     80
2   Nate   55     45
3    Ben   50     50